# A191 Stock Factors 121-140

In [10]:
import dai
import pandas as pd
from a191_sql_base import get_a191_sql_base

In [11]:
sd = '2023-01-01'
ed = '2026-01-01'

## A191 Factor 121

Formula:

`((RANK((VWAP -MIN(VWAP, 12)))^TSRANK(CORR(TSRANK(VWAP, 20), TSRANK(MEAN(VOLUME,60), 2), 18), 3)) * -1)`

In [12]:
sql_alpha_121 = f"""--sql
SELECT
    date,
    instrument,
    ((c_pct_rank((vwap - m_min(vwap, 12)))^
      m_rank(m_corr(m_rank(vwap, 20), m_rank(m_avg(volume,60), 2), 18), 3)) * -1) 
    AS alpha_a191_f0121
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_121), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0121
408819  2023-05-08  000001.SZ         -0.492693
408820  2023-05-08  000002.SZ         -0.406345
408821  2023-05-08  000004.SZ         -0.347403
408822  2023-05-08  000005.SZ         -0.071718
408823  2023-05-08  000006.SZ         -0.322175
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -0.683088
3858341 2025-12-26  688800.SH         -0.918532
3858345 2025-12-26  688819.SH         -0.737587
3858346 2025-12-26  688981.SH         -0.972265
3858347 2025-12-26  689009.SH         -0.460434

[3251593 rows x 3 columns]

## A191 Factor 122

Formula:

`(SMA(SMA(SMA(LOG(CLOSE),13,2),13,2),13,2)-DELAY(SMA(SMA(SMA(LOG(CLOSE),13,2),13,2),13,2),1))/DELAY(SMA(SMA(SMA(LOG(CLOSE),13,2),13,2),13,2),1)`

In [13]:
sql_alpha_122 = f"""--sql
SELECT
    date,
    instrument,
    (m_ta_ewm(m_ta_ewm(m_ta_ewm(log(close),13,2),13,2),13,2) -
     m_lag(m_ta_ewm(m_ta_ewm(m_ta_ewm(log(close),13,2),13,2),13,2),1)) /
    m_lag(m_ta_ewm(m_ta_ewm(m_ta_ewm(log(close),13,2),13,2),13,2),1) 
    AS alpha_a191_f0122
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_122), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0122
10134   2023-01-05  000001.SZ          0.000005
10135   2023-01-05  000002.SZ          0.000006
10136   2023-01-05  000004.SZ         -0.000011
10137   2023-01-05  000005.SZ          0.000027
10138   2023-01-05  000006.SZ         -0.000026
...            ...        ...               ...
3858343 2025-12-26  688805.SH         -0.000043
3858344 2025-12-26  688807.SH         -0.000024
3858345 2025-12-26  688819.SH          0.000202
3858346 2025-12-26  688981.SH          0.000131
3858347 2025-12-26  689009.SH          0.000013

[3663499 rows x 3 columns]

## A191 Factor 123

Formula:

`((RANK(CORR(SUM(((HIGH + LOW) / 2), 20), SUM(MEAN(VOLUME,60), 20), 9))<RANK(CORR(LOW, VOLUME,6))) * -1)`

In [14]:
sql_alpha_123 = f"""--sql
SELECT
    date,
    instrument,
    IF(
        (c_pct_rank(m_corr(m_sum(((high + low) / 2), 20), m_sum(m_avg(volume,60), 20), 9)) <
         c_pct_rank(m_corr(low, volume, 6))),
        1,
        0
    ) * -1
    AS alpha_a191_f0123
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_123), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0123
5067    2023-01-04  000001.SZ               0.0
5068    2023-01-04  000002.SZ               0.0
5069    2023-01-04  000004.SZ               0.0
5070    2023-01-04  000005.SZ               0.0
5071    2023-01-04  000006.SZ               0.0
...            ...        ...               ...
3858343 2025-12-26  688805.SH               0.0
3858344 2025-12-26  688807.SH               0.0
3858345 2025-12-26  688819.SH              -1.0
3858346 2025-12-26  688981.SH              -1.0
3858347 2025-12-26  689009.SH              -1.0

[3668803 rows x 3 columns]

## A191 Factor 124

Formula:

`(CLOSE -VWAP) / DECAYLINEAR(RANK(TSMAX(CLOSE, 30)),2)`

In [15]:
sql_alpha_124 = f"""--sql
SELECT
    date,
    instrument,
    (close -vwap) / m_decay_linear(c_pct_rank(m_max(close, 30)),2) 
    AS alpha_a191_f0124
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_124), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0124
157400  2023-02-22  000001.SZ       1591.208851
157401  2023-02-22  000002.SZ       3002.902065
157402  2023-02-22  000004.SZ         56.112547
157403  2023-02-22  000005.SZ         86.205172
157404  2023-02-22  000006.SZ        243.965029
...            ...        ...               ...
3858340 2025-12-26  688799.SH         34.306420
3858341 2025-12-26  688800.SH         82.792679
3858345 2025-12-26  688819.SH          8.134947
3858346 2025-12-26  688981.SH         -0.753614
3858347 2025-12-26  689009.SH          1.843631

[3509995 rows x 3 columns]

## A191 Factor 125

Formula:

`(RANK(DECAYLINEAR(CORR((VWAP), MEAN(VOLUME,80),17), 20)) / RANK(DECAYLINEAR(DELTA(((CLOSE * 0.5)+ (VWAP * 0.5)), 3), 16)))`

In [16]:
sql_alpha_125 = f"""--sql
SELECT
    date,
    instrument,
    (c_pct_rank(m_decay_linear(m_corr((vwap), m_avg(volume,80),17), 20)) /
     c_pct_rank(m_decay_linear(m_delta(((close * 0.5)+ (vwap * 0.5)), 3), 16))) 
    AS alpha_a191_f0125
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_125), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0125
590580  2023-06-28  000001.SZ         81.446435
590581  2023-06-28  000002.SZ         93.279957
590583  2023-06-28  000005.SZ          0.532452
590584  2023-06-28  000006.SZ          6.061513
590586  2023-06-28  000008.SZ          1.505825
...            ...        ...               ...
3858340 2025-12-26  688799.SH          0.368739
3858341 2025-12-26  688800.SH          0.129258
3858345 2025-12-26  688819.SH          0.654951
3858346 2025-12-26  688981.SH          0.257007
3858347 2025-12-26  689009.SH          0.434217

[3068198 rows x 3 columns]

## A191 Factor 126

Formula:

`(CLOSE+HIGH+LOW)/3`

In [17]:
sql_alpha_126 = f"""--sql
SELECT
    date,
    instrument,
    (close+high+low)/3 
    AS alpha_a191_f0126
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_126), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0126
5067    2023-01-04  000001.SZ       1609.159081
5068    2023-01-04  000002.SZ       3250.243743
5069    2023-01-04  000004.SZ         40.354148
5070    2023-01-04  000005.SZ         17.330417
5071    2023-01-04  000006.SZ        241.554999
...            ...        ...               ...
3858343 2025-12-26  688805.SH         52.063333
3858344 2025-12-26  688807.SH        204.233333
3858345 2025-12-26  688819.SH         37.165192
3858346 2025-12-26  688981.SH        122.683333
3858347 2025-12-26  689009.SH         59.484296

[3668803 rows x 3 columns]

## A191 Factor 127

Formula:

`(MEAN((100*(CLOSE-MAX(CLOSE,12))/(MAX(CLOSE,12)))^2))^(1/2)`

In [18]:
sql_alpha_127 = f"""--sql
SELECT
    date,
    instrument,
    (m_avg((100*(close-m_max(close,12))/(m_max(close,12)))^2, 12))^(1/2) 
    AS alpha_a191_f0127
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_127), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0127
116685  2023-02-10  000001.SZ          5.065550
116686  2023-02-10  000002.SZ          5.237978
116687  2023-02-10  000004.SZ          2.927963
116688  2023-02-10  000005.SZ          3.879295
116689  2023-02-10  000006.SZ          4.822165
...            ...        ...               ...
3858340 2025-12-26  688799.SH          2.954962
3858341 2025-12-26  688800.SH         10.786588
3858345 2025-12-26  688819.SH          2.569418
3858346 2025-12-26  688981.SH          2.722582
3858347 2025-12-26  689009.SH          3.400443

[3552296 rows x 3 columns]

## A191 Factor 128

Formula:

`100-(100/(1+SUM(((HIGH+LOW+CLOSE)/3>DELAY((HIGH+LOW+CLOSE)/3,1)?(HIGH+LOW+CLOSE)/3*VOLUME:0),14)/SUM(((HIGH+LOW+CLOSE)/3<DELAY((HIGH+LOW+CLOSE)/3,1)?(HIGH+LOW+CLOSE)/3*VOLUME:0),14)))`

In [19]:
sql_alpha_128 = f"""--sql
SELECT
    date,
    instrument,
    100 - (100 / (1 + m_sum(IF(((high+low+close)/3 > m_lag((high+low+close)/3,1)),
                               ((high+low+close)/3 * volume), 0), 14) /
                    m_sum(IF(((high+low+close)/3 < m_lag((high+low+close)/3,1)),
                               ((high+low+close)/3 * volume), 0), 14))) 
    AS alpha_a191_f0128
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_128), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0128
70969   2023-01-30  000001.SZ         83.687829
70970   2023-01-30  000002.SZ         43.820196
70971   2023-01-30  000004.SZ         47.290216
70972   2023-01-30  000005.SZ         38.635062
70973   2023-01-30  000006.SZ         25.432511
...            ...        ...               ...
3858340 2025-12-26  688799.SH         61.325352
3858341 2025-12-26  688800.SH         59.848550
3858345 2025-12-26  688819.SH         64.633867
3858346 2025-12-26  688981.SH         72.129059
3858347 2025-12-26  689009.SH         47.883792

[3599199 rows x 3 columns]

## A191 Factor 129

Formula:

`SUM((CLOSE-DELAY(CLOSE,1)<0?ABS(CLOSE-DELAY(CLOSE,1)):0),12)`

In [20]:
sql_alpha_129 = f"""--sql
SELECT
    date,
    instrument,
    m_sum(IF(close - m_lag(close, 1) < 0, abs(close - m_lag(close, 1)), 0), 12) 
    AS alpha_a191_f0129
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_129), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0129
60821   2023-01-19  000001.SZ         55.828743
60822   2023-01-19  000002.SZ        221.214746
60823   2023-01-19  000004.SZ          3.373005
60824   2023-01-19  000005.SZ          1.482816
60825   2023-01-19  000006.SZ         33.098616
...            ...        ...               ...
3858340 2025-12-26  688799.SH          7.747166
3858341 2025-12-26  688800.SH         33.583615
3858345 2025-12-26  688819.SH          2.044887
3858346 2025-12-26  688981.SH         11.150000
3858347 2025-12-26  689009.SH          4.845950

[3610510 rows x 3 columns]

## A191 Factor 130

Formula:

`(RANK(DECAYLINEAR(CORR(((HIGH + LOW) / 2), MEAN(VOLUME,40), 9), 10)) /RANK(DECAYLINEAR(CORR(RANK(VWAP), RANK(VOLUME), 7),3)))`

In [21]:
sql_alpha_130 = f"""--sql
SELECT
    date,
    instrument,
    (c_pct_rank(m_corr(close, m_avg(volume, 60), 10)) -
     c_pct_rank(m_corr(close, m_avg(volume, 10), 6))) 
    AS alpha_a191_f0130
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_130), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0130
352042  2023-04-18  000001.SZ         -0.472272
352043  2023-04-18  000002.SZ          0.736644
352044  2023-04-18  000004.SZ          0.025521
352045  2023-04-18  000005.SZ          0.025925
352046  2023-04-18  000006.SZ         -0.670362
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -0.561822
3858341 2025-12-26  688800.SH          0.306696
3858345 2025-12-26  688819.SH          0.658535
3858346 2025-12-26  688981.SH         -0.915937
3858347 2025-12-26  689009.SH          0.149316

[3309515 rows x 3 columns]

## A191 Factor 131

Formula:

`(RANK(DELAT(VWAP, 1))^TSRANK(CORR(CLOSE,MEAN(VOLUME,50), 18), 18))`

In [22]:
sql_alpha_131 = f"""--sql
SELECT
    date,
    instrument,
    (c_pct_rank(m_delta(vwap, 1))^m_rank(m_corr(close,m_avg(volume,50), 18), 18)) 
    AS alpha_a191_f0131
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_131), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0131
429495  2023-05-12  000001.SZ      1.491392e-09
429496  2023-05-12  000002.SZ      4.527357e-04
429497  2023-05-12  000004.SZ      1.523811e-01
429498  2023-05-12  000005.SZ      6.206269e-01
429499  2023-05-12  000006.SZ      4.461072e-01
...            ...        ...               ...
3858340 2025-12-26  688799.SH      3.627006e-03
3858341 2025-12-26  688800.SH      1.007702e-25
3858345 2025-12-26  688819.SH      5.756493e-01
3858346 2025-12-26  688981.SH      2.381875e-02
3858347 2025-12-26  689009.SH      1.503792e-23

[3230542 rows x 3 columns]

## A191 Factor 132

Formula:

`MEAN(AMOUNT,20)`

In [23]:
sql_alpha_132 = f"""--sql
SELECT
    date,
    instrument,
    m_avg(amount, 20) 
    AS alpha_a191_f0132
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_132), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0132
101438  2023-02-07  000001.SZ      1.708787e+09
101439  2023-02-07  000002.SZ      1.327431e+09
101440  2023-02-07  000004.SZ      1.900868e+07
101441  2023-02-07  000005.SZ      1.366883e+07
101442  2023-02-07  000006.SZ      3.118304e+08
...            ...        ...               ...
3858340 2025-12-26  688799.SH      8.098967e+07
3858341 2025-12-26  688800.SH      9.135002e+08
3858345 2025-12-26  688819.SH      9.397423e+07
3858346 2025-12-26  688981.SH      4.688709e+09
3858347 2025-12-26  689009.SH      3.552255e+08

[3568164 rows x 3 columns]

## A191 Factor 133

Formula:

`((20-HIGHDAY(HIGH,20))/20)*100-((20-LOWDAY(LOW,20))/20)*100`

In [24]:
sql_alpha_133 = f"""--sql
SELECT
    date,
    instrument,
    ((20 - m_imax(high, 20)) / 20) * 100 - ((20 - m_imin(low, 20)) / 20) * 100 
    AS alpha_a191_f0133
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_133), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0133
101438  2023-02-07  000001.SZ             -65.0
101439  2023-02-07  000002.SZ              80.0
101440  2023-02-07  000004.SZ             -40.0
101441  2023-02-07  000005.SZ              60.0
101442  2023-02-07  000006.SZ              55.0
...            ...        ...               ...
3858340 2025-12-26  688799.SH             -60.0
3858341 2025-12-26  688800.SH             -75.0
3858345 2025-12-26  688819.SH             -35.0
3858346 2025-12-26  688981.SH             -30.0
3858347 2025-12-26  689009.SH              20.0

[3568164 rows x 3 columns]

## A191 Factor 134

Formula:

`(CLOSE-DELAY(CLOSE,12))/DELAY(CLOSE,12)*VOLUME`

In [25]:
sql_alpha_134 = f"""--sql
SELECT
    date,
    instrument,
    (close - m_lag(close, 12)) / m_lag(close, 12) * volume 
    AS alpha_a191_f0134
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_134), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0134
65895   2023-01-20  000001.SZ      3.442444e+06
65896   2023-01-20  000002.SZ     -1.295312e+06
65897   2023-01-20  000004.SZ      8.632301e+03
65898   2023-01-20  000005.SZ      9.780753e+04
65899   2023-01-20  000006.SZ     -4.856112e+06
...            ...        ...               ...
3858340 2025-12-26  688799.SH     -3.523145e+03
3858341 2025-12-26  688800.SH     -3.774309e+05
3858345 2025-12-26  688819.SH      1.689746e+05
3858346 2025-12-26  688981.SH      2.003168e+06
3858347 2025-12-26  689009.SH     -1.734741e+05

[3605214 rows x 3 columns]

## A191 Factor 135

Formula:

`SMA(DELAY(CLOSE/DELAY(CLOSE,20),1),20,1)`

In [26]:
sql_alpha_135 = f"""--sql
SELECT
    date,
    instrument,
    m_ta_ewm(m_lag(close / m_lag(close, 20), 1), 20, 1) 
    AS alpha_a191_f0135
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_135), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0135
111600  2023-02-09  000001.SZ          0.980447
111601  2023-02-09  000002.SZ          0.917672
111602  2023-02-09  000004.SZ          1.034137
111603  2023-02-09  000005.SZ          0.973262
111604  2023-02-09  000006.SZ          0.887987
...            ...        ...               ...
3858340 2025-12-26  688799.SH          0.971321
3858341 2025-12-26  688800.SH          1.077608
3858345 2025-12-26  688819.SH          1.010899
3858346 2025-12-26  688981.SH          0.995146
3858347 2025-12-26  689009.SH          0.986764

[3557585 rows x 3 columns]

## A191 Factor 136

Formula:

`(( -1 * RANK(DELTA(RET, 3))) * CORR(OPEN, VOLUME, 10))`

In [27]:
sql_alpha_136 = f"""--sql
SELECT
    date,
    instrument,
    ((-1 * c_pct_rank(m_delta(ret, 3))) * m_corr(open, volume, 10)) 
    AS alpha_a191_f0136
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_136), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0136
50681   2023-01-17  000001.SZ          0.234866
50682   2023-01-17  000002.SZ          0.094126
50683   2023-01-17  000004.SZ         -0.097160
50684   2023-01-17  000005.SZ         -0.029939
50685   2023-01-17  000006.SZ         -0.785232
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -0.102538
3858341 2025-12-26  688800.SH         -0.051850
3858345 2025-12-26  688819.SH         -0.306915
3858346 2025-12-26  688981.SH         -0.126184
3858347 2025-12-26  689009.SH         -0.026782

[3621102 rows x 3 columns]

## A191 Factor 137

Formula:

`16*(CLOSE-DELAY(CLOSE,1)+(CLOSE-OPEN)/2+DELAY(CLOSE,1)-DELAY(OPEN,1))/((ABS(HIGH-DELAY(CLOSE,1))>ABS(LOW-DELAY(CLOSE,1)) &ABS(HIGH-DELAY(CLOSE,1))>ABS(HIGH-DELAY(LOW,1))?ABS(HIGH-DELAY(CLOSE,1))+ABS(LOW-DELAY(CLOSE,1))/2+ABS(DELAY(CLOSE,1)-DELAY(OPEN,1))/4:(ABS(LOW-DELAY(CLOSE,1))>ABS(HIGH-DELAY(LOW,1)) &ABS(LOW-DELAY(CLOSE,1))>ABS(HIGH-DELAY(CLOSE,1))?ABS(LOW-DELAY(CLOSE,1))+ABS(HIGH-DELAY(CLOSE,1))/2+ABS(DELAY(CLOSE,1)-DELAY(OPEN,1))/4:ABS(HIGH-DELAY(LOW,1))+ABS(DELAY(CLOSE,1)-DELAY(OPEN,1))/4)))*MAX(ABS(HIGH-DELAY(CLOSE,1)),ABS(LOW-DELAY(CLOSE,1)))`

In [28]:
sql_alpha_137 = f"""--sql
SELECT
    date,
    instrument,
    16 * (((close - m_lag(close, 1) + (close - open) / 2 + m_lag(close, 1) - m_lag(open, 1)) /
           (IF((abs(high - m_lag(close, 1)) > abs(low - m_lag(close, 1)) AND
                abs(high - m_lag(close, 1)) > abs(high - m_lag(low, 1))),
               (abs(high - m_lag(close, 1)) + abs(low - m_lag(close, 1)) / 2 +
                abs(m_lag(close, 1) - m_lag(open, 1)) / 4),
               IF((abs(low - m_lag(close, 1)) > abs(high - m_lag(low, 1)) AND
                   abs(low - m_lag(close, 1)) > abs(high - m_lag(close, 1))),
                  (abs(low - m_lag(close, 1)) + abs(high - m_lag(close, 1)) / 2 +
                   abs(m_lag(close, 1) - m_lag(open, 1)) / 4),
                  (abs(high - m_lag(low, 1)) + abs(m_lag(close, 1) - m_lag(open, 1)) / 4))))) *
          greatest(abs(high - m_lag(close, 1)), abs(low - m_lag(close, 1)))) 
    AS alpha_a191_f0137
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_137), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0137
10134   2023-01-05  000001.SZ        491.229768
10135   2023-01-05  000002.SZ        873.986588
10136   2023-01-05  000004.SZ         -3.606542
10137   2023-01-05  000005.SZ          6.943921
10138   2023-01-05  000006.SZ       -180.464666
...            ...        ...               ...
3858343 2025-12-26  688805.SH        -18.411815
3858344 2025-12-26  688807.SH       -505.852464
3858345 2025-12-26  688819.SH          9.911893
3858346 2025-12-26  688981.SH        -16.288744
3858347 2025-12-26  689009.SH        -47.465283

[3663499 rows x 3 columns]

## A191 Factor 138

Formula:

`((RANK(DECAYLINEAR(DELTA((((LOW * 0.7) + (VWAP *0.3))), 3), 20)) -TSRANK(DECAYLINEAR(TSRANK(CORR(TSRANK(LOW, 8), TSRANK(MEAN(VOLUME,60), 17), 5), 19), 16), 7)) * -1)`

In [29]:
sql_alpha_138 = f"""--sql
SELECT
    date,
    instrument,
    ((c_pct_rank(m_decay_linear(m_delta((((low * 0.7) + (vwap * 0.3))), 3), 20)) -
      m_rank(m_decay_linear(m_rank(m_corr(m_rank(low, 8), m_rank(m_avg(volume, 60), 17), 5), 19), 16), 7)) * -1)
    AS alpha_a191_f0138
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_138), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0138
611470  2023-07-04  000001.SZ          6.986103
611471  2023-07-04  000002.SZ          2.995166
611473  2023-07-04  000005.SZ          0.318630
611474  2023-07-04  000006.SZ          1.438771
611476  2023-07-04  000008.SZ          0.556093
...            ...        ...               ...
3858340 2025-12-26  688799.SH          3.310693
3858341 2025-12-26  688800.SH          6.049874
3858345 2025-12-26  688819.SH          0.321948
3858346 2025-12-26  688981.SH          0.065399
3858347 2025-12-26  689009.SH          3.381719

[3047314 rows x 3 columns]

## A191 Factor 139

Formula:

`(-1 * CORR(OPEN, VOLUME, 10))`

In [30]:
sql_alpha_139 = f"""--sql
SELECT
    date,
    instrument,
    (-1 * m_corr(open, volume, 10)) 
    AS alpha_a191_f0139
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_139), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0139
50681   2023-01-17  000001.SZ          0.654870
50682   2023-01-17  000002.SZ          0.106054
50683   2023-01-17  000004.SZ         -0.680954
50684   2023-01-17  000005.SZ         -0.705154
50685   2023-01-17  000006.SZ         -0.923392
...            ...        ...               ...
3858340 2025-12-26  688799.SH         -0.375245
3858341 2025-12-26  688800.SH         -0.452703
3858345 2025-12-26  688819.SH         -0.505483
3858346 2025-12-26  688981.SH         -0.377893
3858347 2025-12-26  689009.SH         -0.311252

[3621102 rows x 3 columns]

## A191 Factor 140

Formula:

`MIN(RANK(DECAYLINEAR(((RANK(OPEN) + RANK(LOW)) -(RANK(HIGH) + RANK(CLOSE))), 8)),TSRANK(DECAYLINEAR(CORR(TSRANK(CLOSE, 8), TSRANK(MEAN(VOLUME,60), 20), 8), 7), 3))`

In [31]:
sql_alpha_140 = f"""--sql
SELECT
    date,
    instrument,
    least(c_pct_rank(m_decay_linear(((c_pct_rank(open) + c_pct_rank(low)) -
                                     (c_pct_rank(high) + c_pct_rank(close))), 8)),
          m_rank(m_decay_linear(m_corr(m_rank(close, 8), m_rank(m_avg(volume,60), 20), 8), 7), 3)) 
    AS alpha_a191_f0140
FROM data_base
"""
dai.query(get_a191_sql_base(sql_alpha_140), filters={'date': [sd, ed]}).df().dropna()

              date instrument  alpha_a191_f0140
40543   2023-01-13  000001.SZ          0.384301
40544   2023-01-13  000002.SZ          0.382461
40545   2023-01-13  000004.SZ          0.859158
40546   2023-01-13  000005.SZ          0.664350
40547   2023-01-13  000006.SZ          0.494072
...            ...        ...               ...
3858340 2025-12-26  688799.SH          0.748885
3858341 2025-12-26  688800.SH          0.166764
3858345 2025-12-26  688819.SH          0.691099
3858346 2025-12-26  688981.SH          0.424666
3858347 2025-12-26  689009.SH          0.955982

[3631695 rows x 3 columns]